In [1]:
Titanic=data.frame(Titanic)

In [2]:
attach(Titanic)

In [3]:
head(Titanic)

  Class Sex    Age   Survived Freq
1 1st   Male   Child No        0
2 2nd   Male   Child No        0
3 3rd   Male   Child No       35
4 Crew  Male   Child No        0
5 1st   Female Child No        0
6 2nd   Female Child No        0

In [4]:
table(Titanic$Sex)

  Male Female
    16     16

In [5]:
table(Titanic$Sex,Titanic$Age)

         Child Adult
  Male       8     8
  Female     8     8

In [6]:
table(Titanic$Age,Titanic$Survived)

        No Yes
  Child  8   8
  Adult  8   8

In [7]:
table(Titanic$Age,Titanic$Class)

        1st 2nd 3rd Crew
  Child   4   4   4    4
  Adult   4   4   4    4